tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "nvie/tap"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go", link: false
# Open source programming language to build simple/reliable/efficient software
brew "go@1.21"
# Fast linters runner for Go
brew "golangci-lint"
# Library access to GnuPG
brew "gpgme"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# CLI for ImageOptim, ImageAlpha and JPEGmini
brew "imageoptim-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Mac App Store command-line interface
brew "mas"
# Merge XCode project files in git
brew "mergepbx"
# Platform built on V8 to build network applications
brew "node", link: false
# Platform built on V8 to build network applications
brew "node@18"
# Platform built on V8 to build network applications
brew "node@20"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Little beautifier tool for xcodebuild
brew "xcbeautify"
# JavaScript package manager
brew "yarn"
# Suite of useful Git commands
brew "nvie/tap/git-toolbelt"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Browse/extract images from .car files
cask "asset-catalog-tinkerer"
# Web debugging Proxy application
cask "charles"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Git interface focused on visual interaction
cask "gitup-app"
# Web browser
cask "google-chrome"
# Hex editor focussing on speed
cask "hex-fiend"
# Utility to hide menu bar items
cask "hiddenbar"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Time optimising application
cask "rescuetime"
# MySQL/MariaDB database management
cask "sequel-ace"
# Digital design and prototyping platform
cask "sketch"
# File transfer application
cask "transmit"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Network protocol analyzer
cask "wireshark-app"
# Install and switch between multiple versions of Xcode
cask "xcodes-app"
# Video communication and virtual meeting platform
cask "zoom"
mas "Amphetamine", id: 937984704
mas "DaisyDisk", id: 411643860
mas "Default Browser", id: 1055264211
mas "Gifski", id: 1351639930
mas "GPX Reader", id: 543327839
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Reeder", id: 1529448980
mas "The Clock", id: 488764545
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "humao.rest-client"
vscode "timonwong.shellcheck"
vscode "vscodevim.vim"
vscode "zamerick.vscode-caddyfile-syntax"
