tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.1+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# GUI for vim, made for macOS
brew "macvim", link: false
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# Platform built on V8 to build network applications
brew "node@10"
# Platform built on V8 to build network applications
brew "node@12"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "yarn"
cask "asset-catalog-tinkerer"
cask "charles"
cask "docker"
cask "gitup"
cask "hex-fiend"
cask "macvim"
cask "ngrok"
cask "qlcolorcode"
cask "qlstephen"
cask "wireshark"
mas "1Blocker", id: 1107421413
mas "Amphetamine", id: 937984704
mas "Default Browser", id: 1055264211
mas "Gifski", id: 1351639930
mas "GPX Reader", id: 543327839
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
