tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "nvie/tap"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Library access to GnuPG
brew "gpgme"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# GUI for vim, made for macOS
brew "macvim", link: false
# Mac App Store command-line interface
brew "mas"
# Merge XCode project files in git
brew "mergepbx"
# Platform built on V8 to build network applications
brew "node"
# Platform built on V8 to build network applications
brew "node@10"
# Platform built on V8 to build network applications
brew "node@12"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "yarn"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Suite of useful Git commands
brew "nvie/tap/git-toolbelt"
cask "asset-catalog-tinkerer"
# Web debugging Proxy application
cask "charles"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox"
# Git interface focused on visual interaction
cask "gitup"
# Web browser
cask "google-chrome"
# Hex editor focussing on speed
cask "hex-fiend"
# Text editor
cask "macvim"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
cask "qlstephen"
# Time optimising application
cask "rescuetime"
cask "sketch"
cask "transmit"
# Multimedia player
cask "vlc"
# Open-source code editor
cask "visual-studio-code"
# Network protocol analyzer
cask "wireshark"
# Temporary makeshift alias for the video communication tool Zoom
cask "zoomus"
mas "1Blocker", id: 1107421413
mas "Amphetamine", id: 937984704
mas "DaisyDisk", id: 411643860
mas "Default Browser", id: 1055264211
mas "Gifski", id: 1351639930
mas "GPX Reader", id: 543327839
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Reeder", id: 1529448980
mas "The Clock", id: 488764545
mas "Xcode", id: 497799835
